## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # powerplatform_environment.dev will be created
  + resource "powerplatform_environment" "dev" {
      + azure_region      = (known after apply)
      + billing_policy_id = (known after apply)
      + dataverse         = {
          + currency_code     = "EUR"
          + domain            = (known after apply)
          + language_code     = 1033
          + linked_app_id     = (known after apply)
          + linked_app_type   = (known after apply)
          + linked_app_url    = (known after apply)
          + organization_id   = (known after apply)
          + security_group_id = "00000000-0000-0000-0000-000000000000"
          + url               = (known after apply)
          + version           = (known after apply)
        }
      + display_name      = "github-terraform-test"
      + environment_type  = "Sandbox"
      + id                = (known after apply)
      + location          = "europe"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>